Тест_ЗУП_31_КОРП/src/Documents/ФормированиеАттестационнойКомиссииСотрудников/ФормированиеАттестационнойКомиссииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФормированиеАттестационнойКомиссииСотрудников</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАттестации</name>
    <type>
      <types>CatalogRef.ВидыАттестацийСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодАттестации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАкта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставАттестационнойКомиссии</name>
    <attributes>
      <name>ЧленКомиссии</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>РольВКомиссии</name>
      <type>
        <types>EnumRef.РолиЧленовАттестационнойКомиссии</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/Enums/РолиЧленовАттестационнойКомиссии/РолиЧленовАттестационнойКомиссии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РолиЧленовАттестационнойКомиссии</name>
  <enumValues>
    <name>Председатель</name>
  </enumValues>
  <enumValues>
    <name>Секретарь</name>
  </enumValues>
  <enumValues>
    <name>ЗаместительПредседателя</name>
  </enumValues>
  <enumValues>
    <name>ЧленКомиссии</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <predefined>
    <items>
      <name>УправленческаяОрганизация</name>
      <description>Управленческая организация</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидОбменаСКонтролирующимиОрганами</name>
    <type>
      <types>EnumRef.УдалитьВидыОбменаСКонтролирующимиОрганами</types>
      <types>EnumRef.ВидыОбменаСКонтролирующимиОрганами</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйКодФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОбособленныеПодразделения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйПредприниматель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоОрганаПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганаПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганаФСГС</name>
    <comment>Код органа Федеральной службы государственной статистики</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПодчиненностиФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрупнейшийНалогоплательщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСокращенное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТерриториальногоОрганаПФР</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТерриториальногоОрганаФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>135</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбменКаталогОтправкиДанныхОтчетности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменКаталогПрограммыЭлектроннойПочты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменКодАбонента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрименятьРайонныйКоэффициент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрименятьСевернуюНадбавку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТерриториальныеУсловияПФР</name>
    <type>
      <types>CatalogRef.УдалитьТерриториальныеУсловияПФР</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗаписьОбмена</name>
    <type>
      <types>CatalogRef.УдалитьУчетныеЗаписиДокументооборота</types>
      <types>CatalogRef.УчетныеЗаписиДокументооборота</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКОПФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКОПФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКФС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициентРФ</name>
    <comment>(Регл)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботыСотрудников</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКФС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСевернойНадбавки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Documents/ФормированиеАттестационнойКомиссииСотрудников/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаДокумента.
Функция ОписаниеСоставаДокумента() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.ФормированиеАттестационнойКомиссииСотрудников;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаДокументаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область Печать
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ГрафикАттестацииИКомиссияУтверждаютсяРазнымиДокументами") Тогда
		
		// Приказ об увольнении
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "ЗарплатаКадрыКлиент.ВыполнитьКомандуПечати";
		КомандаПечати.Идентификатор = "ПФ_MXL_ПриказОФормированииАттестационнойКомиссии";
		КомандаПечати.Представление = НСтр("ru = 'Приказ о формировании аттестационной комиссии'");
		КомандаПечати.Порядок = 10;
		
	КонецЕсли;
	
КонецПроцедуры

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ОшибкиПечати          - Список значений  - Ошибки печати  (значение - ссылка на объект, представление - текст
//                           ошибки).
//   ОбъектыПечати         - Список значений  - Объекты печати (значение - ссылка на объект, представление - имя
//                           области в которой был выведен объект).
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПриказОФормированииАттестационнойКомиссии") Тогда
		ТабличныйДокумент = ТабличныйДокументПриказаОФормированииКомиссии(МассивОбъектов, ОбъектыПечати);
		Если НЕ ТабличныйДокумент = Неопределено Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"ПФ_MXL_ПриказОФормированииАттестационнойКомиссии", НСтр("ru = 'Приказ о формировании аттестационной комиссии'"), ТабличныйДокумент);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#Область ПриказОФормированииКомиссии

Функция ТабличныйДокументПриказаОФормированииКомиссии(МассивСсылок, ОбъектыПечати)
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.АвтоМасштаб = Истина;
	ДокументРезультат.КлючПараметровПечати = "ПараметрыПечати_ПриказаОФормированииАттестационнойКомиссии";
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	СоздатьВТКадровыхДанных(Запрос);
	
	ДанныеДляПечатиПриказа = ДанныеДляПечатиПриказаОФормированииКомиссии(Запрос);
	
	Пока ДанныеДляПечатиПриказа.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		ОбластиМакетаПриказа = ОбластиМакетаПриказОФормированииАттестационнойКомиссии(ДанныеДляПечатиПриказа.ВидАттестации);
		
		Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		НомерСтрокиНачалоДокумента = ДокументРезультат.ВысотаТаблицы + 1;
		
		ВывестиШапкуПриказаОФормированииКомиссии(ДокументРезультат, ОбластиМакетаПриказа.ОбластьШапка, ДанныеДляПечатиПриказа);
		
		Пока ДанныеДляПечатиПриказа.СледующийПоЗначениюПоля("ЧленКомиссии") Цикл
			ВывестиСтрокуПриказаОФормированииКомиссии(ДокументРезультат, ОбластиМакетаПриказа.ОбластьЧленКомиссии, ДанныеДляПечатиПриказа);
		КонецЦикла;
		
		ВывестиПодвалПриказаОФормированииКомиссии(ДокументРезультат, ОбластиМакетаПриказа.ОбластьПодвал, ДанныеДляПечатиПриказа);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ДокументРезультат, НомерСтрокиНачалоДокумента, ОбъектыПечати, ДанныеДляПечатиПриказа.Ссылка);
		
	КонецЦикла;	

	Возврат ДокументРезультат;
	
КонецФункции

Процедура ВывестиШапкуПриказаОФормированииКомиссии(ДокументРезультат, ОбластьШапка, ДанныеДляПечатиПриказа)
	
	ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ДанныеДляПечатиПриказа); 
	
	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("НаименованиеОрганизации", НаименованиеОрганизации(ДанныеДляПечатиПриказа));
	СтруктураЗаполнения.Вставить("ВидАкта", 				ВидАктаУтверждающегоКомиссию(ДанныеДляПечатиПриказа));
	СтруктураЗаполнения.Вставить("НомерПриказа", 			ДанныеДляПечатиПриказа.Номер);
	СтруктураЗаполнения.Вставить("ДатаПриказа", 			Формат(ДанныеДляПечатиПриказа.Дата, "ДЛФ=DD"));
	СтруктураЗаполнения.Вставить("ГодАттестации", 			Формат(ДанныеДляПечатиПриказа.ГодАттестации, "ЧГ=0"));
	
	Если ДанныеДляПечатиПриказа.НайтиСледующий(1, "ПорядокРолей") Тогда
		СтруктураЗаполнения.Вставить("Председатель", ДанныеДляПечатиПриказа.ФИОЧленаКомиссии);
	КонецЕсли;
	Если ДанныеДляПечатиПриказа.НайтиСледующий(2, "ПорядокРолей") Тогда
		СтруктураЗаполнения.Вставить("ЗаместительПредседателя", ДанныеДляПечатиПриказа.ФИОЧленаКомиссии);
	КонецЕсли;
	Если ДанныеДляПечатиПриказа.НайтиСледующий(3, "ПорядокРолей") Тогда
		СтруктураЗаполнения.Вставить("СекретарьКомиссии", ДанныеДляПечатиПриказа.ФИОЧленаКомиссии);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, СтруктураЗаполнения);
	
	ДокументРезультат.Вывести(ОбластьШапка);	
	
КонецПроцедуры

Функция ВидАктаУтверждающегоКомиссию(ДанныеДляПечатиПриказа)
	
	ВидАкта = НСтр("ru = 'Приказ'");
	
	Если ЗначениеЗаполнено(ДанныеДляПечатиПриказа.ВидАкта)
		И АттестацииСотрудников.ЭтоАттестацияГосударственныхСлужащих(ДанныеДляПечатиПриказа.ВидАттестации) Тогда
		ВидАкта = ДанныеДляПечатиПриказа.ВидАкта;
	КонецЕсли;
	
	Возврат ВидАкта;
	
КонецФункции

Процедура ВывестиСтрокуПриказаОФормированииКомиссии(ДокументРезультат, ОбластьЧленКомиссии, ДанныеДляПечатиПриказа)
	
	Если ДанныеДляПечатиПриказа.РольВКомиссии = Перечисления.РолиЧленовАттестационнойКомиссии.ЧленКомиссии Тогда
		ЗаполнитьЗначенияСвойств(ОбластьЧленКомиссии.Параметры, ДанныеДляПечатиПриказа);
		ДокументРезультат.Вывести(ОбластьЧленКомиссии);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиПодвалПриказаОФормированииКомиссии(ДокументРезультат, ОбластьПодвал, ДанныеДляПечатиПриказа)
	
	ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, ДанныеДляПечатиПриказа);
	
	ДокументРезультат.Вывести(ОбластьПодвал);
	
КонецПроцедуры

Процедура СоздатьВТКадровыхДанных(Запрос)
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ФормированиеАттестационнойКомиссииСотрудниковСоставАттестационнойКомиссии.ЧленКомиссии КАК ФизическоеЛицо,
	|	ФормированиеАттестационнойКомиссииСотрудников.Дата КАК Период
	|ПОМЕСТИТЬ ВТФизическиеЛицаОбщийСписок
	|ИЗ
	|	Документ.ФормированиеАттестационнойКомиссииСотрудников.СоставАттестационнойКомиссии КАК ФормированиеАттестационнойКомиссииСотрудниковСоставАттестационнойКомиссии
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ФормированиеАттестационнойКомиссииСотрудников КАК ФормированиеАттестационнойКомиссииСотрудников
	|		ПО ФормированиеАттестационнойКомиссииСотрудниковСоставАттестационнойКомиссии.Ссылка = ФормированиеАттестационнойКомиссииСотрудников.Ссылка
	|ГДЕ
	|	ФормированиеАттестационнойКомиссииСотрудников.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ФормированиеАттестационнойКомиссииСотрудников.Руководитель,
	|	ФормированиеАттестационнойКомиссииСотрудников.Дата
	|ИЗ
	|	Документ.ФормированиеАттестационнойКомиссииСотрудников КАК ФормированиеАттестационнойКомиссииСотрудников
	|ГДЕ
	|	ФормированиеАттестационнойКомиссииСотрудников.Ссылка В(&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТФизическиеЛицаОбщийСписок.ФизическоеЛицо,
	|	ВТФизическиеЛицаОбщийСписок.Период
	|ПОМЕСТИТЬ ВТФизическиеЛица
	|ИЗ
	|	ВТФизическиеЛицаОбщийСписок КАК ВТФизическиеЛицаОбщийСписок";
	Запрос.Выполнить();
	
	Описатель = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(Запрос.МенеджерВременныхТаблиц, "ВТФизическиеЛица");
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(Описатель, Истина, "ФИОПолные,ИОФамилия");
	
КонецПроцедуры

Функция ДанныеДляПечатиПриказаОФормированииКомиссии(Запрос)
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФормированиеАттестационнойКомиссииСотрудников.Организация,
	|	ФормированиеАттестационнойКомиссииСотрудников.Руководитель,
	|	ФормированиеАттестационнойКомиссииСотрудников.ДолжностьРуководителя,
	|	ВТКадровыеДанныеРуководителя.ИОФамилия КАК ФИОРуководителя,
	|	ЧленыКомиссии.ЧленКомиссии КАК ЧленКомиссии,
	|	ЧленыКомиссии.РольВКомиссии,
	|	ВЫБОР
	|		КОГДА ЧленыКомиссии.РольВКомиссии = ЗНАЧЕНИЕ(Перечисление.РолиЧленовАттестационнойКомиссии.Председатель)
	|			ТОГДА 1
	|		КОГДА ЧленыКомиссии.РольВКомиссии = ЗНАЧЕНИЕ(Перечисление.РолиЧленовАттестационнойКомиссии.ЗаместительПредседателя)
	|			ТОГДА 2
	|		КОГДА ЧленыКомиссии.РольВКомиссии = ЗНАЧЕНИЕ(Перечисление.РолиЧленовАттестационнойКомиссии.Секретарь)
	|			ТОГДА 3
	|		ИНАЧЕ 4
	|	КОНЕЦ КАК ПорядокРолей,
	|	ВТКадровыеДанныеФизическихЛиц.ФИОПолные КАК ФИОЧленаКомиссии,
	|	ФормированиеАттестационнойКомиссииСотрудников.Ссылка КАК Ссылка,
	|	Организации.НаименованиеПолное,
	|	Организации.НаименованиеСокращенное,
	|	ФормированиеАттестационнойКомиссииСотрудников.ГодАттестации,
	|	ФормированиеАттестационнойКомиссииСотрудников.Номер,
	|	ФормированиеАттестационнойКомиссииСотрудников.Дата,
	|	ФормированиеАттестационнойКомиссииСотрудников.ВидАкта,
	|	ФормированиеАттестационнойКомиссииСотрудников.ВидАттестации
	|ИЗ
	|	Документ.ФормированиеАттестационнойКомиссииСотрудников КАК ФормированиеАттестационнойКомиссииСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ФормированиеАттестационнойКомиссииСотрудников.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК ВТКадровыеДанныеРуководителя
	|		ПО ФормированиеАттестационнойКомиссииСотрудников.Руководитель = ВТКадровыеДанныеРуководителя.ФизическоеЛицо
	|			И ФормированиеАттестационнойКомиссииСотрудников.Дата = ВТКадровыеДанныеРуководителя.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ФормированиеАттестационнойКомиссииСотрудников.СоставАттестационнойКомиссии КАК ЧленыКомиссии
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК ВТКадровыеДанныеФизическихЛиц
	|			ПО ЧленыКомиссии.ЧленКомиссии = ВТКадровыеДанныеФизическихЛиц.ФизическоеЛицо
	|				И ЧленыКомиссии.Ссылка.Дата = ВТКадровыеДанныеФизическихЛиц.Период
	|		ПО (ЧленыКомиссии.Ссылка = ФормированиеАттестационнойКомиссииСотрудников.Ссылка)
	|ГДЕ
	|	ФормированиеАттестационнойКомиссииСотрудников.Ссылка В(&МассивСсылок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка, 
	|	ПорядокРолей,
	|	ФИОЧленаКомиссии";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция НаименованиеОрганизации(Выборка)
	Возврат ?(ЗначениеЗаполнено(Выборка.НаименованиеПолное), Выборка.НаименованиеПолное, Выборка.НаименованиеСокращенное);
КонецФункции 

Функция ОбластиМакетаПриказОФормированииАттестационнойКомиссии(ВидАттестации)
	
	ОбластиМакета = Новый Структура;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") 
		И АттестацииСотрудников.ЭтоАттестацияГосударственныхСлужащих(ВидАттестации) Тогда
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужба");
		ОбластиМакета = Модуль.ОбластиМакетаПриказОФормированииАттестационнойКомиссии();		
		
	Иначе		
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ФормированиеАттестационнойКомиссииСотрудников.ПФ_MXL_ПриказОФормированииАттестационнойКомиссии");
		ОбластиМакета.Вставить("ОбластьШапка", Макет.ПолучитьОбласть("Шапка"));
		ОбластиМакета.Вставить("ОбластьЧленКомиссии", Макет.ПолучитьОбласть("ЧленКомиссии"));
		ОбластиМакета.Вставить("ОбластьПодвал", Макет.ПолучитьОбласть("Подвал"));
		
	КонецЕсли;
	
	Возврат ОбластиМакета;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
